package com.thomas.film.util;

/**
 * @创建人 thomas_liu
 * @创建时间 2018/8/27 0:58
 * @描述 字符串工具类
 */
public class StringUtil {
    // ===========================================================
    // Constants
    // ===========================================================


    // ===========================================================
    // Fields
    // ===========================================================

    // ===========================================================
    // Constructors
    // ===========================================================


    // ===========================================================
    // Getter &amp; Setter
    // ===========================================================

    // ===========================================================
    // Methods for/from SuperClass/Interfaces
    // ===========================================================


    // ===========================================================
    // Methods
    // ===========================================================
    /**
     * 判断是否是空
     * @param str 传入字符
     * @return true or false
     */
    @SuppressWarnings("WeakerAccess")
    public static boolean isEmpty(String str){
        return str==null||"".equals(str.trim());
    }

    /**
     * 判断是否不是空
     * @param str 传入字符
     * @return true or false
     */
    @SuppressWarnings("unused")
    public static boolean isNotEmpty(String str){
        return str!=null&&!"".equals(str.trim());
    }
    // ===========================================================
    // Inner and Anonymous Classes
    // ===========================================================

}